Австралия/src/InformationRegisters/Numbering/Numbering.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Numbering</name>
  <resources>
    <name>CurrentNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Numerator</name>
    <type>
      <types>CatalogRef.Numerators</types>
    </type>
  </dimensions>
  <dimensions>
    <name>NumberingPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DocumentType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>OperationType</name>
    <type>
      <types>EnumRef.OperationTypesGoodsIssue</types>
      <types>EnumRef.OperationTypesDebitNote</types>
      <types>EnumRef.OperationTypesSupplierInvoice</types>
      <types>EnumRef.OperationTypesTaxInvoiceReceived</types>
      <types>EnumRef.OperationTypesPurchaseOrder</types>
      <types>EnumRef.OperationTypesOnlinePayment</types>
      <types>EnumRef.OperationTypesPaymentExpense</types>
      <types>EnumRef.OperationTypesPaymentReceipt</types>
      <types>EnumRef.OperationTypesGoodsReceipt</types>
      <types>EnumRef.OperationTypesEmployeeTask</types>
      <types>EnumRef.OperationTypesCashReceipt</types>
      <types>EnumRef.OperationTypesSalesInvoice</types>
      <types>EnumRef.OperationTypesInventoryTransfer</types>
      <types>EnumRef.OperationTypesSalesOrder</types>
      <types>EnumRef.OperationTypesTaxAccrual</types>
      <types>EnumRef.OperationTypesProduction</types>
      <types>EnumRef.OperationTypesCustomsDeclaration</types>
      <types>EnumRef.OperationTypesTransferAndPromotion</types>
      <types>EnumRef.OperationTypesTransferOrder</types>
      <types>EnumRef.OperationTypesPayrollSheet</types>
      <types>EnumRef.OperationTypesCashVoucher</types>
      <types>EnumRef.OperationTypesOnlineReceipt</types>
      <types>EnumRef.OperationTypesGoodsReturn</types>
      <types>EnumRef.OperationTypesIntraWarehouseTransfer</types>
      <types>EnumRef.OperationTypesArApAdjustments</types>
      <types>EnumRef.OperationTypesProductionOrder</types>
      <types>EnumRef.LoanAccrualTypes</types>
      <types>EnumRef.OperationTypesKitOrder</types>
      <types>EnumRef.OperationTypesAdditionalExpenses</types>
      <types>EnumRef.OperationTypesTaxInvoiceIssued</types>
      <types>EnumRef.OperationTypesCreditNote</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/NumeratorsPeriodicity/NumeratorsPeriodicity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>NumeratorsPeriodicity</name>
  <enumValues>
    <name>Year</name>
  </enumValues>
  <enumValues>
    <name>Quarter</name>
  </enumValues>
  <enumValues>
    <name>Month</name>
  </enumValues>
  <enumValues>
    <name>Day</name>
  </enumValues>
  <enumValues>
    <name>Nonperiodical</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/Numbering/Forms/ListFormForNumerator/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	CommonClientServer.SetFilterItem(List.Filter, "Numerator", Parameters.Numerator);
	
	If ValueIsFilled(Parameters.Numerator) Then
		
		NumeratorData = Numbering.GetNumeratorAttributes(Parameters.Numerator);
		
		Items.NumberingPeriod.Visible = 
			(NumeratorData.Periodicity <> Enums.NumeratorsPeriodicity.Nonperiodical);
		
		Items.DocumentType.Visible	= NumeratorData.IndependentNumberingByDocumentTypes;
		Items.OperationType.Visible	= NumeratorData.IndependentNumberingByOperationTypes;
		Items.Company.Visible		= NumeratorData.IndependentNumberingByCompanies;
		Items.BusinessUnit.Visible	= NumeratorData.IndependentNumberingByBusinessUnits;
		Items.Counterparty.Visible	= NumeratorData.IndependentNumberingByCounterparties;
		
	Else
		
		Items.NumberingPeriod.Visible = False;
		
		Items.DocumentType.Visible	= False;
		Items.OperationType.Visible	= False;
		Items.Company.Visible		= False;
		Items.BusinessUnit.Visible	= False;
		Items.Counterparty.Visible	= False;
		
	EndIf;
	
EndProcedure

#EndRegion
